rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIPI1.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K37_SIPI1.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37_SIPI1
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_SIPI1_H_)  /* Check if memory map has not been already included */
#define S32K37_SIPI1_H_

#include "S32K37_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SIPI1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIPI1_Peripheral_Access_Layer SIPI1 Peripheral Access Layer
 * @{
 */

/** SIPI1 - Size of Registers Arrays */
#define SIPI1_CDR2_COUNT                          8u

/** SIPI1 - Register Layout Typedef */
typedef struct {
  __IO uint32_t CCR0;                              /**< SIPI Channel Control Register 0, offset: 0x0 */
  __IO uint32_t CSR0;                              /**< SIPI Channel Status Register 0, offset: 0x4 */
  uint8_t RESERVED_0[4];
  __IO uint32_t CIR0;                              /**< SIPI Channel Interrupt Register 0, offset: 0xC */
  __IO uint32_t CTOR0;                             /**< SIPI Channel Timeout Register 0, offset: 0x10 */
  __I  uint32_t CCRC0;                             /**< SIPI Channel CRC Register 0, offset: 0x14 */
  __IO uint32_t CAR0;                              /**< SIPI Channel Address Register 0, offset: 0x18 */
  __IO uint32_t CDR0;                              /**< SIPI Channel Data Register 0, offset: 0x1C */
  __IO uint32_t CCR1;                              /**< SIPI Channel Control Register 1, offset: 0x20 */
  __IO uint32_t CSR1;                              /**< SIPI Channel Status Register 1, offset: 0x24 */
  uint8_t RESERVED_1[4];
  __IO uint32_t CIR1;                              /**< SIPI Channel Interrupt Register 1, offset: 0x2C */
  __IO uint32_t CTOR1;                             /**< SIPI Channel Timeout Register 1, offset: 0x30 */
  __I  uint32_t CCRC1;                             /**< SIPI Channel CRC Register 1, offset: 0x34 */
  __IO uint32_t CAR1;                              /**< SIPI Channel Address Register 1, offset: 0x38 */
  __IO uint32_t CDR1;                              /**< SIPI Channel Data Register 1, offset: 0x3C */
  __IO uint32_t CCR2;                              /**< SIPI Channel Control Register 2, offset: 0x40 */
  __IO uint32_t CSR2;                              /**< SIPI Channel Status Register 2, offset: 0x44 */
  uint8_t RESERVED_2[4];
  __IO uint32_t CIR2;                              /**< SIPI Channel Interrupt Register 2, offset: 0x4C */
  __IO uint32_t CTOR2;                             /**< SIPI Channel Timeout Register 2, offset: 0x50 */
  __I  uint32_t CCRC2;                             /**< SIPI Channel CRC Register 2, offset: 0x54 */
  __IO uint32_t CAR2;                              /**< SIPI Channel Address Register 2, offset: 0x58 */
  __IO uint32_t CDR2[SIPI1_CDR2_COUNT];            /**< SIPI Channel Data Register 2, array offset: 0x5C, array step: 0x4 */
  __IO uint32_t CCR3;                              /**< SIPI Channel Control Register 3, offset: 0x7C */
  __IO uint32_t CSR3;                              /**< SIPI Channel Status Register 3, offset: 0x80 */
  uint8_t RESERVED_3[4];
  __IO uint32_t CIR3;                              /**< SIPI Channel Interrupt Register 3, offset: 0x88 */
  __IO uint32_t CTOR3;                             /**< SIPI Channel Timeout Register 3, offset: 0x8C */
  __I  uint32_t CCRC3;                             /**< SIPI Channel CRC Register 3, offset: 0x90 */
  __IO uint32_t CAR3;                              /**< SIPI Channel Address Register 3, offset: 0x94 */
  __IO uint32_t CDR3;                              /**< SIPI Channel Data Register 3, offset: 0x98 */
  __IO uint32_t MCR;                               /**< SIPI Module Configuration Register, offset: 0x9C */
  __IO uint32_t SR;                                /**< SIPI Status Register, offset: 0xA0 */
  __IO uint32_t MAXCR;                             /**< SIPI Max Count Register, offset: 0xA4 */
  __IO uint32_t ARR;                               /**< SIPI Address Reload Register, offset: 0xA8 */
  __IO uint32_t ACR;                               /**< SIPI Address Count Register, offset: 0xAC */
  __IO uint32_t ERR;                               /**< SIPI Error Register, offset: 0xB0 */
  __I  uint32_t DEBUGr;                            /**< SIPI Debug Register, offset: 0xB4, 'r' suffix has been added to avoid clash with DEBUG symbolic constant */
  __I  uint32_t PMR;                               /**< SIPI Performance Monitor register, offset: 0xB8 */
} SIPI1_Type, *SIPI1_MemMapPtr;

/** Number of instances of the SIPI1 module. */
#define SIPI1_INSTANCE_COUNT                     (1u)

/* SIPI1 - Peripheral instance base addresses */
/** Peripheral SIPI base address */
#define IP_SIPI_BASE                             (0x404F0000u)
/** Peripheral SIPI base pointer */
#define IP_SIPI                                  ((SIPI1_Type *)IP_SIPI_BASE)
/** Array initializer of SIPI1 peripheral base addresses */
#define IP_SIPI1_BASE_ADDRS                      { IP_SIPI_BASE }
/** Array initializer of SIPI1 peripheral base pointers */
#define IP_SIPI1_BASE_PTRS                       { IP_SIPI }

/* ----------------------------------------------------------------------------
   -- SIPI1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIPI1_Register_Masks SIPI1 Register Masks
 * @{
 */

/*! @name CCR0 - SIPI Channel Control Register 0 */
/*! @{ */

#define SIPI1_CCR0_DEN_MASK                      (0x1U)
#define SIPI1_CCR0_DEN_SHIFT                     (0U)
#define SIPI1_CCR0_DEN_WIDTH                     (1U)
#define SIPI1_CCR0_DEN(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_DEN_SHIFT)) & SIPI1_CCR0_DEN_MASK)

