rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIPI1.h
#define SIPI1_CCR0_WRT_MASK                      (0x2U)
#define SIPI1_CCR0_WRT_SHIFT                     (1U)
#define SIPI1_CCR0_WRT_WIDTH                     (1U)
#define SIPI1_CCR0_WRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_WRT_SHIFT)) & SIPI1_CCR0_WRT_MASK)

#define SIPI1_CCR0_RRT_MASK                      (0x4U)
#define SIPI1_CCR0_RRT_SHIFT                     (2U)
#define SIPI1_CCR0_RRT_WIDTH                     (1U)
#define SIPI1_CCR0_RRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_RRT_SHIFT)) & SIPI1_CCR0_RRT_MASK)

#define SIPI1_CCR0_IDT_MASK                      (0x8U)
#define SIPI1_CCR0_IDT_SHIFT                     (3U)
#define SIPI1_CCR0_IDT_WIDTH                     (1U)
#define SIPI1_CCR0_IDT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_IDT_SHIFT)) & SIPI1_CCR0_IDT_MASK)

#define SIPI1_CCR0_CHEN_MASK                     (0x20U)
#define SIPI1_CCR0_CHEN_SHIFT                    (5U)
#define SIPI1_CCR0_CHEN_WIDTH                    (1U)
#define SIPI1_CCR0_CHEN(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_CHEN_SHIFT)) & SIPI1_CCR0_CHEN_MASK)

#define SIPI1_CCR0_WL_MASK                       (0xC0U)
#define SIPI1_CCR0_WL_SHIFT                      (6U)
#define SIPI1_CCR0_WL_WIDTH                      (2U)
#define SIPI1_CCR0_WL(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_WL_SHIFT)) & SIPI1_CCR0_WL_MASK)

#define SIPI1_CCR0_TC_MASK                       (0x10000U)
#define SIPI1_CCR0_TC_SHIFT                      (16U)
#define SIPI1_CCR0_TC_WIDTH                      (1U)
#define SIPI1_CCR0_TC(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR0_TC_SHIFT)) & SIPI1_CCR0_TC_MASK)
/*! @} */

/*! @name CSR0 - SIPI Channel Status Register 0 */
/*! @{ */

#define SIPI1_CSR0_CB_MASK                       (0x4U)
#define SIPI1_CSR0_CB_SHIFT                      (2U)
#define SIPI1_CSR0_CB_WIDTH                      (1U)
#define SIPI1_CSR0_CB(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_CB_SHIFT)) & SIPI1_CSR0_CB_MASK)

#define SIPI1_CSR0_ACKR_MASK                     (0x8U)
#define SIPI1_CSR0_ACKR_SHIFT                    (3U)
#define SIPI1_CSR0_ACKR_WIDTH                    (1U)
#define SIPI1_CSR0_ACKR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_ACKR_SHIFT)) & SIPI1_CSR0_ACKR_MASK)

#define SIPI1_CSR0_TID_MASK                      (0x70U)
#define SIPI1_CSR0_TID_SHIFT                     (4U)
#define SIPI1_CSR0_TID_WIDTH                     (3U)
#define SIPI1_CSR0_TID(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_TID_SHIFT)) & SIPI1_CSR0_TID_MASK)

#define SIPI1_CSR0_RAR_MASK                      (0x80U)
#define SIPI1_CSR0_RAR_SHIFT                     (7U)
#define SIPI1_CSR0_RAR_WIDTH                     (1U)
#define SIPI1_CSR0_RAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_RAR_SHIFT)) & SIPI1_CSR0_RAR_MASK)

#define SIPI1_CSR0_READ_RX_MASK                  (0x100U)
#define SIPI1_CSR0_READ_RX_SHIFT                 (8U)
#define SIPI1_CSR0_READ_RX_WIDTH                 (1U)
#define SIPI1_CSR0_READ_RX(x)                    (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_READ_RX_SHIFT)) & SIPI1_CSR0_READ_RX_MASK)

#define SIPI1_CSR0_WRITE_RX_MASK                 (0x200U)
#define SIPI1_CSR0_WRITE_RX_SHIFT                (9U)
#define SIPI1_CSR0_WRITE_RX_WIDTH                (1U)
#define SIPI1_CSR0_WRITE_RX(x)                   (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR0_WRITE_RX_SHIFT)) & SIPI1_CSR0_WRITE_RX_MASK)
/*! @} */

/*! @name CIR0 - SIPI Channel Interrupt Register 0 */
/*! @{ */

#define SIPI1_CIR0_ACKIE_MASK                    (0x1U)
#define SIPI1_CIR0_ACKIE_SHIFT                   (0U)
#define SIPI1_CIR0_ACKIE_WIDTH                   (1U)
#define SIPI1_CIR0_ACKIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_ACKIE_SHIFT)) & SIPI1_CIR0_ACKIE_MASK)

#define SIPI1_CIR0_TIDIE_MASK                    (0x2U)
#define SIPI1_CIR0_TIDIE_SHIFT                   (1U)
#define SIPI1_CIR0_TIDIE_WIDTH                   (1U)
#define SIPI1_CIR0_TIDIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_TIDIE_SHIFT)) & SIPI1_CIR0_TIDIE_MASK)

#define SIPI1_CIR0_TOIE_MASK                     (0x4U)
#define SIPI1_CIR0_TOIE_SHIFT                    (2U)
#define SIPI1_CIR0_TOIE_WIDTH                    (1U)
#define SIPI1_CIR0_TOIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_TOIE_SHIFT)) & SIPI1_CIR0_TOIE_MASK)

#define SIPI1_CIR0_TCIE_MASK                     (0x8U)
#define SIPI1_CIR0_TCIE_SHIFT                    (3U)
#define SIPI1_CIR0_TCIE_WIDTH                    (1U)
#define SIPI1_CIR0_TCIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_TCIE_SHIFT)) & SIPI1_CIR0_TCIE_MASK)

#define SIPI1_CIR0_RAIE_MASK                     (0x10U)
#define SIPI1_CIR0_RAIE_SHIFT                    (4U)
#define SIPI1_CIR0_RAIE_WIDTH                    (1U)
#define SIPI1_CIR0_RAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_RAIE_SHIFT)) & SIPI1_CIR0_RAIE_MASK)

#define SIPI1_CIR0_WAIE_MASK                     (0x20U)
#define SIPI1_CIR0_WAIE_SHIFT                    (5U)
#define SIPI1_CIR0_WAIE_WIDTH                    (1U)
#define SIPI1_CIR0_WAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR0_WAIE_SHIFT)) & SIPI1_CIR0_WAIE_MASK)
/*! @} */

/*! @name CTOR0 - SIPI Channel Timeout Register 0 */
/*! @{ */

#define SIPI1_CTOR0_TOR_MASK                     (0xFFFFFFFFU)
#define SIPI1_CTOR0_TOR_SHIFT                    (0U)
#define SIPI1_CTOR0_TOR_WIDTH                    (32U)
#define SIPI1_CTOR0_TOR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CTOR0_TOR_SHIFT)) & SIPI1_CTOR0_TOR_MASK)
/*! @} */

/*! @name CCRC0 - SIPI Channel CRC Register 0 */
/*! @{ */

#define SIPI1_CCRC0_CRCT_MASK                    (0xFFFFU)
#define SIPI1_CCRC0_CRCT_SHIFT                   (0U)
#define SIPI1_CCRC0_CRCT_WIDTH                   (16U)
#define SIPI1_CCRC0_CRCT(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC0_CRCT_SHIFT)) & SIPI1_CCRC0_CRCT_MASK)

#define SIPI1_CCRC0_CRCI_MASK                    (0xFFFF0000U)
#define SIPI1_CCRC0_CRCI_SHIFT                   (16U)
#define SIPI1_CCRC0_CRCI_WIDTH                   (16U)
#define SIPI1_CCRC0_CRCI(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC0_CRCI_SHIFT)) & SIPI1_CCRC0_CRCI_MASK)
/*! @} */

/*! @name CAR0 - SIPI Channel Address Register 0 */
/*! @{ */

#define SIPI1_CAR0_CAR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CAR0_CAR_SHIFT                     (0U)
#define SIPI1_CAR0_CAR_WIDTH                     (32U)
#define SIPI1_CAR0_CAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CAR0_CAR_SHIFT)) & SIPI1_CAR0_CAR_MASK)
/*! @} */

/*! @name CDR0 - SIPI Channel Data Register 0 */
/*! @{ */

#define SIPI1_CDR0_CDR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CDR0_CDR_SHIFT                     (0U)
#define SIPI1_CDR0_CDR_WIDTH                     (32U)
#define SIPI1_CDR0_CDR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CDR0_CDR_SHIFT)) & SIPI1_CDR0_CDR_MASK)
/*! @} */

/*! @name CCR1 - SIPI Channel Control Register 1 */
/*! @{ */

#define SIPI1_CCR1_DEN_MASK                      (0x1U)
#define SIPI1_CCR1_DEN_SHIFT                     (0U)
#define SIPI1_CCR1_DEN_WIDTH                     (1U)
#define SIPI1_CCR1_DEN(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_DEN_SHIFT)) & SIPI1_CCR1_DEN_MASK)

#define SIPI1_CCR1_WRT_MASK                      (0x2U)
#define SIPI1_CCR1_WRT_SHIFT                     (1U)
#define SIPI1_CCR1_WRT_WIDTH                     (1U)
#define SIPI1_CCR1_WRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_WRT_SHIFT)) & SIPI1_CCR1_WRT_MASK)

#define SIPI1_CCR1_RRT_MASK                      (0x4U)
#define SIPI1_CCR1_RRT_SHIFT                     (2U)
#define SIPI1_CCR1_RRT_WIDTH                     (1U)
#define SIPI1_CCR1_RRT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_RRT_SHIFT)) & SIPI1_CCR1_RRT_MASK)

#define SIPI1_CCR1_IDT_MASK                      (0x8U)
#define SIPI1_CCR1_IDT_SHIFT                     (3U)
#define SIPI1_CCR1_IDT_WIDTH                     (1U)
#define SIPI1_CCR1_IDT(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_IDT_SHIFT)) & SIPI1_CCR1_IDT_MASK)

