rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIPI1.h
#define SIPI1_CCR1_CHEN_MASK                     (0x20U)
#define SIPI1_CCR1_CHEN_SHIFT                    (5U)
#define SIPI1_CCR1_CHEN_WIDTH                    (1U)
#define SIPI1_CCR1_CHEN(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_CHEN_SHIFT)) & SIPI1_CCR1_CHEN_MASK)

#define SIPI1_CCR1_WL_MASK                       (0xC0U)
#define SIPI1_CCR1_WL_SHIFT                      (6U)
#define SIPI1_CCR1_WL_WIDTH                      (2U)
#define SIPI1_CCR1_WL(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_WL_SHIFT)) & SIPI1_CCR1_WL_MASK)

#define SIPI1_CCR1_TC_MASK                       (0x10000U)
#define SIPI1_CCR1_TC_SHIFT                      (16U)
#define SIPI1_CCR1_TC_WIDTH                      (1U)
#define SIPI1_CCR1_TC(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CCR1_TC_SHIFT)) & SIPI1_CCR1_TC_MASK)
/*! @} */

/*! @name CSR1 - SIPI Channel Status Register 1 */
/*! @{ */

#define SIPI1_CSR1_CB_MASK                       (0x4U)
#define SIPI1_CSR1_CB_SHIFT                      (2U)
#define SIPI1_CSR1_CB_WIDTH                      (1U)
#define SIPI1_CSR1_CB(x)                         (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_CB_SHIFT)) & SIPI1_CSR1_CB_MASK)

#define SIPI1_CSR1_ACKR_MASK                     (0x8U)
#define SIPI1_CSR1_ACKR_SHIFT                    (3U)
#define SIPI1_CSR1_ACKR_WIDTH                    (1U)
#define SIPI1_CSR1_ACKR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_ACKR_SHIFT)) & SIPI1_CSR1_ACKR_MASK)

#define SIPI1_CSR1_TID_MASK                      (0x70U)
#define SIPI1_CSR1_TID_SHIFT                     (4U)
#define SIPI1_CSR1_TID_WIDTH                     (3U)
#define SIPI1_CSR1_TID(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_TID_SHIFT)) & SIPI1_CSR1_TID_MASK)

#define SIPI1_CSR1_RAR_MASK                      (0x80U)
#define SIPI1_CSR1_RAR_SHIFT                     (7U)
#define SIPI1_CSR1_RAR_WIDTH                     (1U)
#define SIPI1_CSR1_RAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_RAR_SHIFT)) & SIPI1_CSR1_RAR_MASK)

#define SIPI1_CSR1_READ_RX_MASK                  (0x100U)
#define SIPI1_CSR1_READ_RX_SHIFT                 (8U)
#define SIPI1_CSR1_READ_RX_WIDTH                 (1U)
#define SIPI1_CSR1_READ_RX(x)                    (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_READ_RX_SHIFT)) & SIPI1_CSR1_READ_RX_MASK)

#define SIPI1_CSR1_WRITE_RX_MASK                 (0x200U)
#define SIPI1_CSR1_WRITE_RX_SHIFT                (9U)
#define SIPI1_CSR1_WRITE_RX_WIDTH                (1U)
#define SIPI1_CSR1_WRITE_RX(x)                   (((uint32_t)(((uint32_t)(x)) << SIPI1_CSR1_WRITE_RX_SHIFT)) & SIPI1_CSR1_WRITE_RX_MASK)
/*! @} */

/*! @name CIR1 - SIPI Channel Interrupt Register 1 */
/*! @{ */

#define SIPI1_CIR1_ACKIE_MASK                    (0x1U)
#define SIPI1_CIR1_ACKIE_SHIFT                   (0U)
#define SIPI1_CIR1_ACKIE_WIDTH                   (1U)
#define SIPI1_CIR1_ACKIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_ACKIE_SHIFT)) & SIPI1_CIR1_ACKIE_MASK)

#define SIPI1_CIR1_TIDIE_MASK                    (0x2U)
#define SIPI1_CIR1_TIDIE_SHIFT                   (1U)
#define SIPI1_CIR1_TIDIE_WIDTH                   (1U)
#define SIPI1_CIR1_TIDIE(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_TIDIE_SHIFT)) & SIPI1_CIR1_TIDIE_MASK)

#define SIPI1_CIR1_TOIE_MASK                     (0x4U)
#define SIPI1_CIR1_TOIE_SHIFT                    (2U)
#define SIPI1_CIR1_TOIE_WIDTH                    (1U)
#define SIPI1_CIR1_TOIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_TOIE_SHIFT)) & SIPI1_CIR1_TOIE_MASK)

#define SIPI1_CIR1_TCIE_MASK                     (0x8U)
#define SIPI1_CIR1_TCIE_SHIFT                    (3U)
#define SIPI1_CIR1_TCIE_WIDTH                    (1U)
#define SIPI1_CIR1_TCIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_TCIE_SHIFT)) & SIPI1_CIR1_TCIE_MASK)

#define SIPI1_CIR1_RAIE_MASK                     (0x10U)
#define SIPI1_CIR1_RAIE_SHIFT                    (4U)
#define SIPI1_CIR1_RAIE_WIDTH                    (1U)
#define SIPI1_CIR1_RAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_RAIE_SHIFT)) & SIPI1_CIR1_RAIE_MASK)

#define SIPI1_CIR1_WAIE_MASK                     (0x20U)
#define SIPI1_CIR1_WAIE_SHIFT                    (5U)
#define SIPI1_CIR1_WAIE_WIDTH                    (1U)
#define SIPI1_CIR1_WAIE(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CIR1_WAIE_SHIFT)) & SIPI1_CIR1_WAIE_MASK)
/*! @} */

/*! @name CTOR1 - SIPI Channel Timeout Register 1 */
/*! @{ */

#define SIPI1_CTOR1_TOR_MASK                     (0xFFFFFFFFU)
#define SIPI1_CTOR1_TOR_SHIFT                    (0U)
#define SIPI1_CTOR1_TOR_WIDTH                    (32U)
#define SIPI1_CTOR1_TOR(x)                       (((uint32_t)(((uint32_t)(x)) << SIPI1_CTOR1_TOR_SHIFT)) & SIPI1_CTOR1_TOR_MASK)
/*! @} */

/*! @name CCRC1 - SIPI Channel CRC Register 1 */
/*! @{ */

#define SIPI1_CCRC1_CRCT_MASK                    (0xFFFFU)
#define SIPI1_CCRC1_CRCT_SHIFT                   (0U)
#define SIPI1_CCRC1_CRCT_WIDTH                   (16U)
#define SIPI1_CCRC1_CRCT(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC1_CRCT_SHIFT)) & SIPI1_CCRC1_CRCT_MASK)

#define SIPI1_CCRC1_CRCI_MASK                    (0xFFFF0000U)
#define SIPI1_CCRC1_CRCI_SHIFT                   (16U)
#define SIPI1_CCRC1_CRCI_WIDTH                   (16U)
#define SIPI1_CCRC1_CRCI(x)                      (((uint32_t)(((uint32_t)(x)) << SIPI1_CCRC1_CRCI_SHIFT)) & SIPI1_CCRC1_CRCI_MASK)
/*! @} */

/*! @name CAR1 - SIPI Channel Address Register 1 */
/*! @{ */

#define SIPI1_CAR1_CAR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CAR1_CAR_SHIFT                     (0U)
#define SIPI1_CAR1_CAR_WIDTH                     (32U)
#define SIPI1_CAR1_CAR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CAR1_CAR_SHIFT)) & SIPI1_CAR1_CAR_MASK)
/*! @} */

/*! @name CDR1 - SIPI Channel Data Register 1 */
/*! @{ */

#define SIPI1_CDR1_CDR_MASK                      (0xFFFFFFFFU)
#define SIPI1_CDR1_CDR_SHIFT                     (0U)
#define SIPI1_CDR1_CDR_WIDTH                     (32U)
#define SIPI1_CDR1_CDR(x)                        (((uint32_t)(((uint32_t)(x)) << SIPI1_CDR1_CDR_SHIFT)) & SIPI1_CDR1_CDR_MASK)
/*! @} */

